In [178]:
print('hello')

hello

<center><font size="8" color=blue>Class 01 Import Data</font></center>

In [179]:
import pandas as pd #pandas库类似excel软件
import numpy as np #numpy好比构建excel逻辑的底层语句
pd.set_option('display.max_columns', None) #让pandas显示所有的**列columns**，行是rows

<font size="5">查看数据的编码</font>
>注意路径，要用‘/’，而不能用‘\’
>>使用相对路径，一定要和代码在同一个文件夹下面;相对路径还利于小组成员查看，合作

In [180]:
import chardet

def check_encoding(filename):
    rawdata = open(filename, 'rb').read()
    result = chardet.detect(rawdata)
    encoding = result['encoding']
    confidence = result['confidence']
    return encoding, confidence

file_path = './000001.csv'# 我用相对路径./表示当前目录
encoding, confidence = check_encoding(file_path)
print(f"Encoding: {encoding}, Confidence: {confidence}")

Encoding: ascii, Confidence: 1.0

<font size="5" color=red>直接使用data和print(data)的区别</font>

Jupyter Notebook默认只输出或者打印最后一行命令，如果你需要所有中间步骤的结果都输出的话，需要添加如下的代码

In [181]:
from IPython.core.interactiveshell import InteractiveShell  # 导入Jupyter交互式Shell的核心模块
InteractiveShell.ast_node_interactivity = 'all'
# 设置Jupyter Notebook的输出模式为'all'，这样每个单元格中所有语句的结果都会被依次输出（默认只输出最后一个表达式的结果）

In [182]:
data = pd.read_csv('./000001.csv') # 导入CSV文件
data
print(data)

             Day  Preclose      Open   Highest    Lowest     Close
0     1990/12/19              96.050    99.980    95.790    99.980
1     1990/12/20     99.98   104.300   104.390    99.980   104.390
2     1990/12/21    104.39   109.070   109.130   103.730   109.130
3     1990/12/24    109.13   113.570   114.550   109.130   114.550
4     1990/12/25    114.55   120.090   120.250   114.550   120.250
...          ...       ...       ...       ...       ...       ...
8468   2025/8/25  3825.759  3848.163  3883.562  3839.972  3883.562
8469   2025/8/26  3883.562  3871.471  3888.599  3859.758  3868.382
8470   2025/8/27  3868.382  3869.612  3887.198  3800.350  3800.350
8471   2025/8/28   3800.35  3796.711  3845.087  3761.422  3843.597
8472   2025/8/29  3843.597  3842.823  3867.606  3839.206  3857.927

[8473 rows x 6 columns]

             Day  Preclose      Open   Highest    Lowest     Close
0     1990/12/19              96.050    99.980    95.790    99.980
1     1990/12/20     99.98   104.300   104.390    99.980   104.390
2     1990/12/21    104.39   109.070   109.130   103.730   109.130
3     1990/12/24    109.13   113.570   114.550   109.130   114.550
4     1990/12/25    114.55   120.090   120.250   114.550   120.250
...          ...       ...       ...       ...       ...       ...
8468   2025/8/25  3825.759  3848.163  3883.562  3839.972  3883.562
8469   2025/8/26  3883.562  3871.471  3888.599  3859.758  3868.382
8470   2025/8/27  3868.382  3869.612  3887.198  3800.350  3800.350
8471   2025/8/28   3800.35  3796.711  3845.087  3761.422  3843.597
8472   2025/8/29  3843.597  3842.823  3867.606  3839.206  3857.927

[8473 rows x 6 columns]

- 直接使用<span style="color: #87CEEB">**data**</span>可以以**美观**的表格形式显示DataFrame（带边框、行列对齐）
- 使用<span style="color: #87CEEB">**print(data)**</span>以**纯文本**形式输出（无边框，对齐可能不完美）

In [183]:
type(data) #查看变量格式

pandas.core.frame.DataFrame

In [184]:
print(data.columns) #输出index对象（列名+数据类型信息）

Index(['Day', 'Preclose', 'Open', 'Highest', 'Lowest', 'Close'], dtype='object')

In [185]:
print(data.columns.values) #输出列名数组

['Day' 'Preclose' 'Open' 'Highest' 'Lowest' 'Close']

<font size="6" color=pink>时间序列数据的格式 Time-Series Data 以及 数据框 Dataframe的基本知识</font>

In [186]:
data['Day'] #1
data.Day #2
data[['Day']] #3
type(data['Day'])
type(data.Day)
type(data[['Day']])

0       1990/12/19
1       1990/12/20
2       1990/12/21
3       1990/12/24
4       1990/12/25
           ...
8468     2025/8/25
8469     2025/8/26
8470     2025/8/27
8471     2025/8/28
8472     2025/8/29
Name: Day, Length: 8473, dtype: object

0       1990/12/19
1       1990/12/20
2       1990/12/21
3       1990/12/24
4       1990/12/25
           ...
8468     2025/8/25
8469     2025/8/26
8470     2025/8/27
8471     2025/8/28
8472     2025/8/29
Name: Day, Length: 8473, dtype: object

             Day
0     1990/12/19
1     1990/12/20
2     1990/12/21
3     1990/12/24
4     1990/12/25
...          ...
8468   2025/8/25
8469   2025/8/26
8470   2025/8/27
8471   2025/8/28
8472   2025/8/29

[8473 rows x 1 columns]

pandas.core.series.Series

pandas.core.series.Series

pandas.core.frame.DataFrame

<font size="5" color=pink>区别</font>
- 注释中1、2两种查看'Day'列的结果一致，返回一维Series结构，由一组数据（值）和与之关联的索引组成  
- 注释3返回DataFrame，是二维的，有行列，所以要获取多行需两个[],下面展示

In [187]:
data[['Day','Close']]

             Day     Close
0     1990/12/19    99.980
1     1990/12/20   104.390
2     1990/12/21   109.130
3     1990/12/24   114.550
4     1990/12/25   120.250
...          ...       ...
8468   2025/8/25  3883.562
8469   2025/8/26  3868.382
8470   2025/8/27  3800.350
8471   2025/8/28  3843.597
8472   2025/8/29  3857.927

[8473 rows x 2 columns]

In [188]:
data[0:8] #切片选取前8行数据

          Day  Preclose    Open  Highest  Lowest   Close
0  1990/12/19             96.05    99.98   95.79   99.98
1  1990/12/20     99.98  104.30   104.39   99.98  104.39
2  1990/12/21    104.39  109.07   109.13  103.73  109.13
3  1990/12/24    109.13  113.57   114.55  109.13  114.55
4  1990/12/25    114.55  120.09   120.25  114.55  120.25
5  1990/12/26    120.25  125.27   125.27  120.25  125.27
6  1990/12/27    125.27  125.27   125.28  125.27  125.28
7  1990/12/28    125.28  126.39   126.45  125.28  126.45

In [189]:
data.iloc[0:9,0:4] #使用 iloc 按照行号和列号进行数据选择，获取0-8行前0-4列

          Day  Preclose    Open  Highest
0  1990/12/19             96.05    99.98
1  1990/12/20     99.98  104.30   104.39
2  1990/12/21    104.39  109.07   109.13
3  1990/12/24    109.13  113.57   114.55
4  1990/12/25    114.55  120.09   120.25
5  1990/12/26    120.25  125.27   125.27
6  1990/12/27    125.27  125.27   125.28
7  1990/12/28    125.28  126.39   126.45
8  1990/12/31    126.45  126.56   127.61

- at+行索引+列标题实现对单元格的访问

In [190]:
data.at[3, 'Highest']

np.float64(114.55)

In [191]:
data[data['Day'] == "1990/12/25"] #筛选出日期为"1990/12/25"的行

          Day Preclose    Open  Highest  Lowest   Close
4  1990/12/25   114.55  120.09   120.25  114.55  120.25

In [192]:
data[data['Day'] == "1990/12/25"].Open #获取日期为"1990/12/25"的开盘价

4    120.09
Name: Open, dtype: float64

<font size="5" color=pink>将'Day'列从字符串格式转换为日期时间格式</font>

In [193]:
data['Day'] = pd.to_datetime(data['Day'],format = '%Y/%m/%d') 
data
# pd.to_datetime() 将字符串转换为datetime对象
# format='%Y/%m/%d' 指定了输入日期的格式：年/月/日（如2025/9/10）

            Day  Preclose      Open   Highest    Lowest     Close
0    1990-12-19              96.050    99.980    95.790    99.980
1    1990-12-20     99.98   104.300   104.390    99.980   104.390
2    1990-12-21    104.39   109.070   109.130   103.730   109.130
3    1990-12-24    109.13   113.570   114.550   109.130   114.550
4    1990-12-25    114.55   120.090   120.250   114.550   120.250
...         ...       ...       ...       ...       ...       ...
8468 2025-08-25  3825.759  3848.163  3883.562  3839.972  3883.562
8469 2025-08-26  3883.562  3871.471  3888.599  3859.758  3868.382
8470 2025-08-27  3868.382  3869.612  3887.198  3800.350  3800.350
8471 2025-08-28   3800.35  3796.711  3845.087  3761.422  3843.597
8472 2025-08-29  3843.597  3842.823  3867.606  3839.206  3857.927

[8473 rows x 6 columns]

In [194]:
data = data.sort_values(by=['Day'], axis=0, ascending=True) #对'Day'列降序排序，axis=0表示列，1为行，True为升序，False为降序
data

            Day  Preclose      Open   Highest    Lowest     Close
0    1990-12-19              96.050    99.980    95.790    99.980
1    1990-12-20     99.98   104.300   104.390    99.980   104.390
2    1990-12-21    104.39   109.070   109.130   103.730   109.130
3    1990-12-24    109.13   113.570   114.550   109.130   114.550
4    1990-12-25    114.55   120.090   120.250   114.550   120.250
...         ...       ...       ...       ...       ...       ...
8468 2025-08-25  3825.759  3848.163  3883.562  3839.972  3883.562
8469 2025-08-26  3883.562  3871.471  3888.599  3859.758  3868.382
8470 2025-08-27  3868.382  3869.612  3887.198  3800.350  3800.350
8471 2025-08-28   3800.35  3796.711  3845.087  3761.422  3843.597
8472 2025-08-29  3843.597  3842.823  3867.606  3839.206  3857.927

[8473 rows x 6 columns]

<font size="6"> 更改行索引 </font>   
<font size="5" color=pink>注意</font>   
inplace=False/True   
False原数据框上**不会**进行修改  
True直接在原数据框上进行修改，不创建新的数据框

In [195]:
df2=data.set_index('Day', inplace =False)
df2
data

            Preclose      Open   Highest    Lowest     Close
Day
1990-12-19              96.050    99.980    95.790    99.980
1990-12-20     99.98   104.300   104.390    99.980   104.390
1990-12-21    104.39   109.070   109.130   103.730   109.130
1990-12-24    109.13   113.570   114.550   109.130   114.550
1990-12-25    114.55   120.090   120.250   114.550   120.250
...              ...       ...       ...       ...       ...
2025-08-25  3825.759  3848.163  3883.562  3839.972  3883.562
2025-08-26  3883.562  3871.471  3888.599  3859.758  3868.382
2025-08-27  3868.382  3869.612  3887.198  3800.350  3800.350
2025-08-28   3800.35  3796.711  3845.087  3761.422  3843.597
2025-08-29  3843.597  3842.823  3867.606  3839.206  3857.927

[8473 rows x 5 columns]

            Day  Preclose      Open   Highest    Lowest     Close
0    1990-12-19              96.050    99.980    95.790    99.980
1    1990-12-20     99.98   104.300   104.390    99.980   104.390
2    1990-12-21    104.39   109.070   109.130   103.730   109.130
3    1990-12-24    109.13   113.570   114.550   109.130   114.550
4    1990-12-25    114.55   120.090   120.250   114.550   120.250
...         ...       ...       ...       ...       ...       ...
8468 2025-08-25  3825.759  3848.163  3883.562  3839.972  3883.562
8469 2025-08-26  3883.562  3871.471  3888.599  3859.758  3868.382
8470 2025-08-27  3868.382  3869.612  3887.198  3800.350  3800.350
8471 2025-08-28   3800.35  3796.711  3845.087  3761.422  3843.597
8472 2025-08-29  3843.597  3842.823  3867.606  3839.206  3857.927

[8473 rows x 6 columns]

In [196]:
#改'Day'为行索引，这样更改后可直接通过日期访问行数据
data.set_index('Day', inplace = True)
data #inplace=True 表示直接在原数据框上进行修改，不创建新的数据框

            Preclose      Open   Highest    Lowest     Close
Day
1990-12-19              96.050    99.980    95.790    99.980
1990-12-20     99.98   104.300   104.390    99.980   104.390
1990-12-21    104.39   109.070   109.130   103.730   109.130
1990-12-24    109.13   113.570   114.550   109.130   114.550
1990-12-25    114.55   120.090   120.250   114.550   120.250
...              ...       ...       ...       ...       ...
2025-08-25  3825.759  3848.163  3883.562  3839.972  3883.562
2025-08-26  3883.562  3871.471  3888.599  3859.758  3868.382
2025-08-27  3868.382  3869.612  3887.198  3800.350  3800.350
2025-08-28   3800.35  3796.711  3845.087  3761.422  3843.597
2025-08-29  3843.597  3842.823  3867.606  3839.206  3857.927

[8473 rows x 5 columns]

使用时间范围筛选数据   
这种筛选方式对于时间序列数据分析非常有用

In [197]:
data['1999-10':'2000-05']

           Preclose     Open  Highest   Lowest    Close
Day
1999-10-08   1570.7  1568.24  1568.38  1531.80  1534.52
1999-10-11  1534.52  1529.22  1538.34  1516.62  1522.48
1999-10-12  1522.48  1526.45  1538.28  1526.45  1537.80
1999-10-13   1537.8  1540.60  1544.45  1504.39  1507.42
1999-10-14  1507.42  1504.50  1535.24  1494.94  1508.73
...             ...      ...      ...      ...      ...
2000-05-25  1855.49  1866.56  1880.72  1860.78  1880.70
2000-05-26   1880.7  1885.75  1890.69  1860.92  1879.62
2000-05-29  1879.62  1885.55  1900.67  1882.74  1898.75
2000-05-30  1898.75  1903.53  1908.31  1868.61  1877.47
2000-05-31  1877.47  1875.46  1894.58  1869.34  1894.55

[151 rows x 5 columns]